[
  {
    "id": "76b0bacf-b35c-4466-9510-6295f5a23d48",
    "title": "Girlhacks Hackathon 2025",
    "description": "<p>Girlhacks Hackathon 2025 is our biggest event of the year and a wonderful opportunity to unleash one’s creativity and push the boundaries of possibilities.  This is an all-day event where participants will </p>\n\n<ul>\n<li><p>Come up with an idea</p></li>\n<li><p>form small teams of 1 to 4 members</p></li>\n<li><p>build a technology that is useful to the community. </p></li>\n</ul>\n\n<p>There will be exciting prizes for the top 3 teams 🏆.  </p>\n\n<p>Registrations are open. Submit your idea today at:</p>\n\n<p><a href=\"https://www.girlhacks.net/hackathon-2025\" rel=\"noopener noreferrer\">https://www.girlhacks.net/hackathon-2025</a></p>\n\n<p>We are looking for volunteers with event coordination.  Please reach out to us at <a href=\"mailto:girlhacksorg@gmail.com\">girlhacksorg@gmail.com</a> if you are interested in volunteering.</p>",
    "what": "hackathon",
    "when_at": "2025-04-26 17:43:14.000000",
    "where_city": null,
    "who": "Sowmya Manjanatha",
    "skills": [
      "ai"
    ],
    "topic_tags": [
      "hackathon",
      "community",
      "career",
      "volunteering"
    ],
    "source_url": "https://dev.to/sowmya_manjanatha_eeff8ac/girlhacks-hackathon-2025-16cp"
  },
  {
    "id": "e04d859c-5fad-4a57-82fc-6a5c900866db",
    "title": "OneShot Hackathon: Win $3K With A Single Prompt",
    "description": "<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fm3xsee4cqh8xtvra5tjd.jpg\"><img alt=\"GibsonAI Hackathon Banner\" height=\"533\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fm3xsee4cqh8xtvra5tjd.jpg\" width=\"800\" /></a></p>\n\n<p>Are you ready to test your prompt engineering skills? We're running the <strong>GibsonAI OneShot Hackathon</strong> where the best prompt wins!</p>\n\n<h2>\n  \n  \n  What's New?\n</h2>\n\n<p>Last week we launched our MCP server to connect your preferred LLM/IDE to GibsonAI's backend databases. This week we're taking it to the masses with a hackathon designed for senior devs and vibe coders alike.</p>\n\n<h2>\n  \n  \n  The Challenge\n</h2>\n\n<p>The <strong>GibsonAI OneShot Hackathon</strong> presents a unique challenge: <strong>Create the most impressive, fully-functional application with the fewest possible AI prompts.</strong> Yeah, one shot is hard, so we have $1K for a 1-shot full stack app and the number of follow up prompts is a judging criteria.</p>\n\n<h2>\n  \n  \n  Using GibsonAI's MCP Server\n</h2>\n\n<p><strong>GibsonAI's MCP server</strong> is really the reason we are doing this hackathon. We want to get people using it and gather feedback so we can iterate and improve. That's why there's a $500 prize for most valuable feedback as well. </p>\n\n<h2>\n  \n  \n  Submission Requirements\n</h2>\n\n<p>Just use our MCP server, that's about it! You'll be submitting your prompt and your stack so we can try to replicate your app, and providing a video and code is always cool, too.</p>\n\n<h2>\n  \n  \n  Judging Criteria\n</h2>\n\n<p>We're assembling a panel of judges with expertise in AI, product management, investing, and engineering. They'll evaluate your submissions based on:</p>\n\n<ul>\n<li>\n<strong>Prompt Efficiency (35%)</strong>: How much functionality achieved with how few prompts</li>\n<li>\n<strong>Functionality (25%)</strong>: Does the app work as intended and solve a real problem</li>\n<li>\n<strong>Design &amp; UX (15%)</strong>: Visual appeal and user experience</li>\n<li>\n<strong>Creativity (15%)</strong>: Originality and innovative use of GibsonAI</li>\n<li>\n<strong>Reproducibility (10%)</strong>: Success rate when recreating the app using your provided prompt and stack</li>\n</ul>\n\n<p>The judges will attempt to recreate your application using your submitted prompt(s) and development stack, so be sure to include accurate details about your environment and tools.</p>\n\n<h2>\n  \n  \n  You Don't Have To Win To Win\n</h2>\n\n<p>The top prize of $3,000, and there's $1K for the best one-shot app, but there is also and a $500 bonus if you refer the ultimate winner! </p>\n\n<p>Sign up at <strong><a href=\"https://hackathon.gibsonai.com\" rel=\"noopener noreferrer\">hackathon.gibsonai.com</a></strong> (the first \"entry\" in the contest, by the way) and get a shareable link. You can also see <strong>the prompt we designed to build the site</strong> (and yes, we had numerous follow-up prompts but the MVP worked!).</p>\n\n<p>Everyone who enters will also get three months free of GibsonAI's starter plan.</p>\n\n<h2>\n  \n  \n  Plenty of Time To Enter!\n</h2>\n\n<p>Submit your apps and prompts between now and <strong>May 4, 2025, 11:59 PM EST</strong> - Star Wars day! Feel free to refine your prompts and submit additional entries (up to three). We'll hold a webinar on May 15th to announce the winners, so get prompting!</p>\n\n<h2>\n  \n  \n  From Prompt To Prod To Profit!\n</h2>\n\n<p>Join the OneShot Hackathon post haste at <a href=\"https://hackathon.gibsonai.com\" rel=\"noopener noreferrer\">hackathon.gibsonai.com</a>, get your referral link, and demonstrate sick prompt engineering skills!</p>\n\n<p>Questions? We're <strong>always on our <a href=\"https://discord.gg/gibsonai\" rel=\"noopener noreferrer\">Discord</a></strong> and will be monitoring it closely throughout the hackathon to support you.</p>",
    "what": "hackathon",
    "when_at": "2025-04-24 23:08:34.000000",
    "where_city": null,
    "who": "Ammon Brown",
    "skills": [
      "aws",
      "ai",
      "backend"
    ],
    "topic_tags": [
      "ai",
      "hackathon",
      "promptengineering",
      "devchallenge"
    ],
    "source_url": "https://dev.to/gibsonai/oneshot-hackathon-win-3k-with-a-single-prompt-j2j"
  },
  {
    "id": "afea0c43-14f3-4b8c-bda5-c74b05b746e8",
    "title": "Hack the Grid: LUKSO's Final Call to Web3 Builders with $150K in Prizes",
    "description": "<p><em>LUKSO’s “Hack the Grid” hackathon is in its final phase, giving developers just under two weeks to build and submit mini-dApps powered by smart contract accounts, gasless UX, and Universal Profiles.</em></p>\n\n<p>Backed by LUKSO’s Foundation for the New Creative Economies (<a href=\"https://lukso.network/foundation\" rel=\"noopener noreferrer\">FNCΞ</a>), this final wave of the <a href=\"https://lukso.gitcoin.co\" rel=\"noopener noreferrer\">Hack the Grid Hackathon</a> invites developers to experiment with a new design space for Web3: one where identity, ownership, and social interaction are native to the stack.</p>\n\n<h2>\n  \n  \n  Why Build on LUKSO?\n</h2>\n\n<p><a href=\"https://lukso.network/\" rel=\"noopener noreferrer\">LUKSO</a> is a Layer 1 EVM blockchain, but it’s not just “another chain.” It was built from the ground up with Universal Profiles, smart contract-based accounts with customizable permissions, metadata, and social features, that solve the UX and security issues plaguing traditional EOAs.</p>\n\n<p>For developers, that means:</p>\n\n<ul>\n<li>No gas tokens required for users (transactions can be relayed)</li>\n<li>Fine-grained permissions and secure controller logic (via Key Manager)</li>\n<li>Reactive contracts that can respond to on-chain events</li>\n<li>Built-in support for digital identity, token registries, and automation</li>\n</ul>\n\n<p>In other words: the blockchain account becomes the platform.</p>\n\n<h2>\n  \n  \n  Funding &amp; Track Details\n</h2>\n\n<p>The current round offers $150,000 in LYX across multiple grant tiers:</p>\n\n<ul>\n<li>Prime Grants – 2 winners × $9,000</li>\n<li>Core Grants – 3 winners × $5,000</li>\n<li>Origin Grants – 4 winners × $2,250</li>\n<li>Level 4: Community Grants – $24,000 distributed via quadratic funding on Gitcoin</li>\n</ul>\n\n<p>Developers are invited to submit mini-dApps that leverage Universal Profiles and the LUKSO Standard Proposals (LSPs), a new suite of smart contract standards designed for user-centric applications.</p>\n\n<p><strong>Suggested themes include:</strong></p>\n\n<ul>\n<li>Onchain social tools</li>\n<li>DAO &amp; treasury management</li>\n<li>Custom profile extensions</li>\n<li>Smart token &amp; NFT utilities</li>\n<li>DePIN integrations</li>\n<li>Wallet-less onboarding experiences</li>\n</ul>\n\n<h2>\n  \n  \n  Resources &amp; How to Apply\n</h2>\n\n<ul>\n<li>Apply and submit here: <a href=\"https://lukso.gitcoin.co\" rel=\"noopener noreferrer\">https://lukso.gitcoin.co</a>\n</li>\n<li>Hackathon guide and submission tips: <a href=\"https://medium.com/lukso/hack-the-grid-best-practices-for-mini-dapp-submissions-ee4f5dd2c584\" rel=\"noopener noreferrer\">Best Practices</a>\n</li>\n</ul>\n\n<p>The hackathon runs through early May 2025, with submission deadlines fast approaching. Winning projects not only receive grants but also increased visibility across the LUKSO ecosystem, including potential inclusion in the Universal Everything platform and long-term funding via the LUKSO Grants Program.</p>\n\n<p>As the crypto space moves beyond DeFi and speculation, LUKSO is creating what a truly usable, creator-friendly Web3 can look like. With standards for social recovery, metadata-rich NFTs, programmable identities, and gasless onboarding, the chain is designed for builders who care about UX, privacy, and long-term adoption.</p>\n\n<blockquote>\n<p>“This is your chance to build something people can actually use, not just trade,”<br />\n says the LUKSO team. </p>\n\n<p>“We’ve built the infrastructure. Now it’s time to build the experiences.”</p>\n</blockquote>\n\n<p>Final submissions due in less than two weeks. Don’t miss your chance to be part of what many are calling the New Web3, one built for humans.</p>",
    "what": "hackathon",
    "when_at": "2025-04-24 15:31:59.000000",
    "where_city": null,
    "who": "Alex",
    "skills": [
      "react",
      "ai",
      "blockchain",
      "web3"
    ],
    "topic_tags": [
      "hackathon",
      "webdev",
      "news",
      "devchallenge"
    ],
    "source_url": "https://dev.to/alexonchain/hack-the-grid-luksos-final-call-to-web3-builders-with-150k-in-prizes-1phb"
  },
  {
    "id": "4b0ec881-e1ec-4fab-a951-2a1a3e85346e",
    "title": "Celebrating our step towards sustainability this Environment Day — because change begins with us.",
    "description": "<div class=\"ltag__link\">\n  <a class=\"ltag__link__link\" href=\"/denyme24\">\n    <div class=\"ltag__link__pic\">\n      <img alt=\"denyme24\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Fuser%2Fprofile_image%2F2986332%2Fb5115442-0d3d-45b1-b11b-1b20bb60eec3.jpg\" />\n    </div>\n  </a>\n  <a class=\"ltag__link__link\" href=\"https://dev.to/denyme24/we-came-we-coded-we-cleaned-the-planet-and-won-4ich\">\n    <div class=\"ltag__link__content\">\n      <h2>We Came. We Coded. We Cleaned the Planet (and Won).</h2>\n      <h3>Naman Raj ・ Apr 15</h3>\n      <div class=\"ltag__link__taglist\">\n        <span class=\"ltag__link__tag\">#hackathon</span>\n        <span class=\"ltag__link__tag\">#devjournal</span>\n        <span class=\"ltag__link__tag\">#machinelearning</span>\n        <span class=\"ltag__link__tag\">#showdev</span>\n      </div>\n    </div>\n  </a>\n</div>",
    "what": "hackathon",
    "when_at": "2025-04-22 18:52:59.000000",
    "where_city": null,
    "who": "Khushi Agrawal",
    "skills": [
      "aws",
      "ai"
    ],
    "topic_tags": [
      "hackathon",
      "devjournal",
      "machinelearning",
      "showdev"
    ],
    "source_url": "https://dev.to/khushihiagrawal/celebrating-our-step-towards-sustainability-this-environment-day-because-change-begins-with-us-5aec"
  },
  {
    "id": "5ee69a16-01a9-46b2-be82-18fdfbb43902",
    "title": "Hackathon's experience",
    "description": "<p>Hello Guys,</p>\n\n<p>Today I have participated in Build2Learn Hackathon for the second time. It was a good community to make friends and make new ideas and it's also convert the ideas into working model.</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F44lzsywshfo47dtm9yk1.jpg\"><img alt=\"Build2Learn\" height=\"388\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F44lzsywshfo47dtm9yk1.jpg\" width=\"800\" /></a></p>\n\n<p>I practice my knowledge with real-time scenarios and try to make progress within given time, I think it's very helpful in my professional career.</p>\n\n<p>The hackathon mimics the office environment, hence I don't get excited or even get struggle when I entered into office.</p>\n\n<p>I meet new people who are already working with best in my field (comp sci). That gives the thoughts about the actual dev.</p>\n\n<p>By the way, today I had no new idea but in the hackathon I collaborate with a new team who are creating a \"QUERY BUILDER\". The actual pipeline takes an input from user and matches the relevant scenario with the table headers in the database.</p>\n\n<p>This process gives the relevant columns and thereafter it writes the SQL query to retrieve the relevant answers based on the retrieved columns.</p>\n\n<p>This is the idea they had. In the hackathon they work in the backend using Flask and Gemini model for predicting the relevant query based on the user words.</p>\n\n<p>I work with them and create a new frontend interface with React and it's look like a typical chatbot interface.</p>\n\n<p>We couldn't integrate the frontend with Flask, but we found out the problem finally and also the given time was finished.</p>\n\n<p>Overall the experience very close to my profession. I thought it was very good practice and also it helps me to find new people.</p>\n\n<p>You can review the code if you like to help me, here is the <br />\nFrontend UI codeRepo link - <a href=\"https://gitlab.com/vasudevan-repo/querybuilder\" rel=\"noopener noreferrer\">https://gitlab.com/vasudevan-repo/querybuilder</a></p>\n\n<p>output:</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fddwu5ecwj1cog6ftkvae.png\"><img alt=\"Query Builder\" height=\"378\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fddwu5ecwj1cog6ftkvae.png\" width=\"800\" /></a></p>",
    "what": "hackathon",
    "when_at": "2025-04-19 17:08:02.000000",
    "where_city": null,
    "who": "Vasudevan Tamilarasan",
    "skills": [
      "react",
      "aws",
      "backend",
      "frontend"
    ],
    "topic_tags": [
      "programming",
      "webdev",
      "react",
      "hackathon"
    ],
    "source_url": "https://dev.to/vasutamil19/hackathons-experience-3cpo"
  },
  {
    "id": "a8504122-dfa7-4324-aacb-42bda3cb506a",
    "title": "We Came. We Coded. We Cleaned the Planet (and Won).",
    "description": "<blockquote>\n<h2>\n  \n  \n  ⚙️ Set the Scene\n</h2>\n</blockquote>\n\n<p>It all started with an open problem, a crew too stubborn to quit, and 24 hours to ship something real.</p>\n\n<p>We entered this <strong>national-level hackathon</strong> with a clear goal: to build something that didn’t just work but mattered. The theme was <strong>Open Innovation</strong>, and while the freedom was exciting, we knew we had to be intentional. Instead of chasing trends, we focused on a problem that’s real, relevant, and way too often ignored- <strong>waste management</strong>.</p>\n\n<p>That’s how <strong>3RVision</strong> was born. An AI-powered platform designed to help users identify household waste and figure out whether it can be <em>reused, recycled, or resold</em>. It’s a practical, user-focused solution for a global issue. Built with machine learning, clean UI, and an emphasis on sustainability, we aimed to make responsible living more accessible and a little bit smarter.</p>\n\n<p>We weren’t trying to impress with flashy features we wanted to solve a real-world problem in a way that actually sticks.</p>\n\n<p>The 24 hours were intense. <strong>Between debugging models</strong>, <strong>designing flows</strong>, and <strong>juggling backend chaos</strong>, there were moments we genuinely thought we wouldn’t make it in time. But somehow, everything clicked just enough in the final stretch. <strong>And yeah that last-minute demo that somehow actually worked?</strong> Definitely one for the memory books.</p>\n\n<blockquote>\n<h2>\n  \n  \n  👥 The Dream Team\n</h2>\n</blockquote>\n\n<p>Every winning project needs a team that just <em>clicks</em>, and we had that from the jump.</p>\n\n<p>There weren’t strict roles or <strong><em>“you do this, I do that</em></strong>” energy. We were all in, all the time switching gears between frontend, backend, ML, and sometimes just keeping each other sane. Everyone wore multiple hats, and somehow, it worked.</p>\n\n<ul>\n<li><p><a href=\"https://github.com/khushiiagrawal\" rel=\"noopener noreferrer\"><strong>Khushi</strong></a> – The <strong>team lead</strong> and the brain behind the idea. She steered <br />\nthe ship, worked on the ML side, and constantly pushed the UI to <br />\nlook and feel better. Super picky about the frontend—and yeah, she <br />\nkept me on my toes with it 😮‍💨.</p></li>\n<li><p><strong><a href=\"https://github.com/Denyme24\" rel=\"noopener noreferrer\">Naman (me)</a></strong> – Took charge of the <strong>frontend</strong>, handled components, API stuff, Authentication and also chipped in on the backend. Made sure everything worked like it should, visually and under the hood.</p></li>\n<li><p><strong><a href=\"https://github.com/Arpit529Srivastava\" rel=\"noopener noreferrer\">Arpit</a></strong> – The utility player who pulled off two big wins building the <strong>Chrome extension</strong> and strengthening the backend. He was the kind of dev who quietly shipped features that just worked no fuss, no fluff, just clean execution.</p></li>\n<li><p><strong><a href=\"https://github.com/Shrey327\" rel=\"noopener noreferrer\">Shreyansh</a></strong> – The wild card turned MVP. He went all-in on the ML side <strong>training our custom models</strong>, fine-tuning performance, and basically doing the kind of wizardry that made the AI magic real. He joined in a little later but made a massive impact in no time</p></li>\n</ul>\n\n<blockquote>\n<h2>\n  \n  \n  🌱 Birth of 3RVision\n</h2>\n</blockquote>\n\n<p>The idea for <strong>3RVision</strong> came from a simple realization: there’s a ton of waste out there, and people often don’t know what to do with it. With increasing environmental concerns, we wanted to create a practical solution that helps people identify whether an item can be <strong>reused, recycled, or resold</strong> right from their phone.</p>\n\n<p>It was clear that the challenge of waste management wasn’t just about <em>knowing</em> what could be recycled, but <em>how</em> to make it easy for people to make informed, eco-friendly decisions. So, we decided to tackle this with AI, combining image recognition to offer suggestions for each item whether it was fit for recycling, resale, or reuse.</p>\n\n<p>There were debates along the way could we expand beyond just waste management? Should we focus on something more abstract? But in the end, we locked onto this problem because it felt practical, relevant, and scalable. Plus, we could really make a difference with it. And let’s be real, who doesn’t love building something that can make a positive impact?</p>\n\n<blockquote>\n<h2>\n  \n  \n  🛠️ Game Time – The Hack Begins\n</h2>\n</blockquote>\n\n<p>We kicked off the hack with all the enthusiasm in the world. The morning went pretty smooth frontend coming together, models being trained, vibes were solid.</p>\n\n<p><strong>Khushi</strong> and <strong>Shreyansh</strong> were deep into training the core ML models, I was locking in the frontend, and <strong>Arpit was busy setting up the Chrome extension</strong> getting those early pieces in place so we could integrate it all later.</p>\n\n<p>Around evening, the organizers hit us with a surprise <strong>jamming session</strong> and not gonna lie, it was <em>exactly</em> what we needed. 10/10 would jam again.</p>\n\n<p>Now, back to the grind. Post-jam, things got a bit… spicy.</p>\n\n<p>There were some weird bugs in the extension it wasn’t properly classifying items into <strong>degradable vs. biodegradable</strong>. <strong>Me and Arpit</strong> tag-teamed it and squashed that mess before dinner. Clean fix, good vibes</p>\n\n<p>But the real pain hit when <strong>Shreyansh’s model training crashed</strong> network issues mid-process. Bro left it training during the jam, and came back to find everything wiped. Khushi, on the other side, had another model training simultaneously, so Shreyansh had to restart from scratch. 🫠</p>\n\n<p>By the time dinner rolled around, everything seemed set up frontend ✅, extension ✅, ML ✅.</p>\n\n<p>But the <strong>backend?</strong> Not even close.<br />\nWe didn’t know it yet, but we were about to enter chaos mode.</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fd33qfops3rgi8ffwm9xh.jpg\"><img alt=\"Fixing Chrome Extension\" height=\"533\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fd33qfops3rgi8ffwm9xh.jpg\" width=\"800\" /></a></p>\n\n<blockquote>\n<h2>\n  \n  \n  ⚡ Clutch Moments – Bounce Back Energy\n</h2>\n</blockquote>\n\n<p>Okay, so here’s where things went full <strong><em>“will they make it or not”</em></strong> mode.</p>\n\n<p>By 11 PM, the backend was the only thing standing between us and a fully functional system. And it wasn’t just one integration we had to:</p>\n\n<ul>\n<li>Connect the <strong>frontend to the ML model</strong>\n</li>\n<li>Connect the <strong>frontend to the backend</strong> (built in Go)</li>\n<li>And finally, connect the <strong>backend to the ML model (running on a Flask server)</strong>\n</li>\n</ul>\n\n<p>Basically, a full-on relay race with two different servers and a lot of bugs in between.</p>\n\n<p>Me and Arpit sat down thinking, <em>“Okay, couple hours max.”</em><br />\nReality check: it took us <strong>till 6 AM</strong>.</p>\n\n<p>There were CORS issues, data not syncing right, weird behavior when Go tried to communicate with Flask, and a bunch of edge cases that kept popping out of nowhere. But with each successful response, we got closer.</p>\n\n<p>Finally, when we saw the frontend fully talk to Go, which then made a clean call to Flask and got back a prediction it was like…<br />\n<strong>inner peace unlocked.</strong></p>\n\n<p>Watching the entire pipeline run smoothly after 6 hours of chaos?<br />\nYeah, that moment hit different.</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F5a5g8596eep5lwmsd81h.jpg\"><img alt=\"Late night chaos\" height=\"1035\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F5a5g8596eep5lwmsd81h.jpg\" width=\"800\" /></a></p>\n\n<blockquote>\n<h2>\n  \n  \n  🎤 The Pitch – It’s Show Time\n</h2>\n</blockquote>\n\n<p>We were riding on zero sleep and infinite adrenaline.<br />\nThe product? Ready.<br />\nThe presentation? Not so much.</p>\n\n<p>We hadn’t prepped any fancy slides or rehearsed a pitch just raw conviction and a working build. Some features didn’t make it in due to time (rip to our extra functionalities).</p>\n\n<p><strong>First round</strong>, we were called to one of the labs.<br />\n<strong>Khushi and Arpit</strong> stepped up, laptops in hand.<br />\nKhushi took the lead and bro, she <strong>snapped</strong>.<br />\nClear, confident, and straight to the point. It wasn’t just a walkthrough—it was a proper storytelling session of what 3RVision stood for and what it could do.</p>\n\n<p>We walked the judges through the features—<strong>ML predictions</strong>, <strong>waste classification</strong>, the <strong>Chrome extension</strong> in action, <strong>clean UI</strong>, and <strong>smooth backend integration</strong>.<br />\nAnd the <strong>live demo?</strong> Bro… it actually worked. Like, everything just clicked at the right time. No bugs, no lags. It felt good- <em>really</em> good.</p>\n\n<p>After wrapping up, we headed to the auditorium for another jamming session.<br />\nIt was just what we needed. Chill vibes, music, and a moment to breathe after the storm.</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fsw4yvu6ai86ygwusowri.jpg\"><img alt=\"first_round_pitch\" height=\"533\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fsw4yvu6ai86ygwusowri.jpg\" width=\"800\" /></a></p>\n\n<blockquote>\n<h2>\n  \n  \n  🏁 The Final Lap – Top 6, Showdown &amp; The Win\n</h2>\n</blockquote>\n\n<p>We were just vibing in the auditorium post-demo, soaking it all in, when Khushi got a call.<br />\nWe were selected in the <strong>Top 6</strong>.<br />\nFor a second, we just froze. Like <strong>wait, us?</strong></p>\n\n<p>The final round was calling, and we had to show up again. No room for error now.<br />\nWe prepped in silence, running through key points, refining our story this time, it wasn’t just about features. It was about <strong>vision</strong>, <strong>scalability</strong>, and the <strong>“why us?”</strong> of it all.</p>\n\n<p>Back to the same lab, but this time with <strong>more judges</strong>, and a slightly heavier vibe. The pressure was real.<br />\nStill, Khushi stepped up again and <em><strong>killed it</strong></em>. This round dove deeper into the <strong>business model</strong>, <strong>revenue possibilities</strong>, and <strong>future roadmap</strong>. We highlighted the packed set of features and why this wasn't just another hackathon build, it had potential. Real, tangible potential.</p>\n\n<p>There were some solid cross-questions from the panel. We held our ground and answered them all.<br />\nNo blank stares. No panic. Just a team that knew what it built.</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F0koqhiwcyr9e4wfb2y4p.jpg\"><img alt=\"second_round_pitch\" height=\"533\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F0koqhiwcyr9e4wfb2y4p.jpg\" width=\"800\" /></a></p>\n\n<p>After about 15 minutes, we were told to head for Lunch.<br />\nAnd on the way, something wild happened <br />\nThe <strong>Professor of ISE</strong> came up to us and asked for a <strong>selfie</strong>.<br />\nWe were like, <em>“Uhhh… what just happened?”</em><br />\nThat moment? Kinda confirmed what we were all feeling inside we might just take this.</p>\n\n<p>Fast forward to <strong>auditorium</strong>, final results.</p>\n\n<p>Started with the usual boring speeches 😒 (no offense, Chief Guest), but all we could hear was our own heartbeat.</p>\n\n<p><strong>Third place... not us.</strong><br />\nBittersweet. Still hoping.</p>\n\n<p><strong>Second place... also not us.</strong><br />\nNow we’re fully in “it’s either us or nothing” mode.</p>\n\n<p><strong>And then...</strong></p>\n\n<blockquote>\n<h2>\n  \n  \n  🥇 “First Position… Team Quaternary!”\n</h2>\n</blockquote>\n\n<p>Bruhhh,we <strong>exploded</strong>. Screams. Hugs. Pure disbelief.<br />\nOut of <strong>21</strong> solid teams, <strong>we came out on top</strong>.<br />\nThe sleepless night, the endless debugging, the full-stack hustle, the caffeine-fueled grind—<strong>all of it was worth it.</strong></p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fg6x9ndoefofndxifmmv3.jpg\"><img alt=\"final_glory\" height=\"533\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fg6x9ndoefofndxifmmv3.jpg\" width=\"800\" /></a></p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fwpy023qiyjbprmuzyiga.jpg\"><img alt=\"certificates\" height=\"533\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fwpy023qiyjbprmuzyiga.jpg\" width=\"800\" /></a></p>\n\n<blockquote>\n<h2>\n  \n  \n  🚀 That’s a Wrap\n</h2>\n</blockquote>\n\n<p>From day-one brainstorming to that final pitch, the whole journey was wild in the best way.<br />\nWe built, broke, fixed, and figured things out as a team, learning more in 24 hours than we probably did in weeks.</p>\n\n<p>What started as just an idea turned into something we’re genuinely proud of.<br />\nWalking away with the win? Yeah, that felt amazing.<br />\nBut honestly, it’s the grind, the laughs, the chaos, and the crew that made it all worth it.</p>\n\n<p>Thanks for sticking around and reading our story! 🙌<br />\nThis wasn’t meant to be a technical deep-dive but more of a raw, real peek into our hackathon journey.</p>\n\n<p>Here’s to more late-night builds, good vibes, and taking ideas beyond the hackathon.</p>\n\n<p>Till the next all-nighter. 👋</p>",
    "what": "hackathon",
    "when_at": "2025-04-15 13:43:50.000000",
    "where_city": null,
    "who": "Naman Raj",
    "skills": [
      "aws",
      "ai",
      "ml",
      "backend",
      "frontend"
    ],
    "topic_tags": [
      "hackathon",
      "devjournal",
      "machinelearning",
      "showdev"
    ],
    "source_url": "https://dev.to/denyme24/we-came-we-coded-we-cleaned-the-planet-and-won-4ich"
  },
  {
    "id": "03af3da8-0ee8-47b6-bdee-798de9bb462f",
    "title": "15 April: Shader Workshop — V Hackathon",
    "description": "<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fp5n226kgtc9qyne59h68.jpeg\"><img alt=\"Preview\" height=\"416\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fp5n226kgtc9qyne59h68.jpeg\" width=\"800\" /></a><br />\nInterested in joining the <a href=\"https://hackathon.v.systems/\" rel=\"noopener noreferrer\">V Hackathon</a> but you have questions about it and about Shader art?</p>\n\n<p>Join our V Hackathon Shader Workshop on Tuesday, 15 April, at 9 pm (GMT+8) on the V Systems' <a href=\"https://discord.gg/up7yVYp3nX\" rel=\"noopener noreferrer\">Discord Voice Channel</a>, to learn more about Shader art and the upcoming challenge!</p>\n\n<p>Hosted by <a href=\"http://www.v.systems/\" rel=\"noopener noreferrer\">V Systems</a>, the workshop will be joined by Ksenia Kendrashova, a seasoned web developer with extensive expertise in graphics, motion design, animation, and visualization. Ksenia is also <a href=\"https://vsystems.medium.com/meet-the-judges-v-shaders-hackathon-b62454d4e144\" rel=\"noopener noreferrer\">one of the four judges</a> who will be evaluating the Shader projects submitted by the Hackathon’s participants.</p>\n\n<p>In this workshop, participants will explore the fundamentals of Shader development, learning techniques to create captivating visual effects for web applications. Ksenia will share her methodologies and best practices, along with practical demonstrations, empowering attendees to craft their own unique shaders.</p>\n\n<p>Join us for this opportunity to improve your coding skills and boost your chances to win up to $1000 in the V Shader Hackathon!</p>\n\n<ul>\n<li>Date: Tuesday, April 15, 2025​</li>\n<li>Host: V Systems</li>\n<li>Shader Expert: Ksenia Kondrashova</li>\n<li>Time: 3 PM (CET) / 9:00 PM (GMT+8​)</li>\n<li>Platform: <a href=\"https://discord.gg/up7yVYp3nX\" rel=\"noopener noreferrer\">Discord​ Voice Channel</a>\n</li>\n</ul>\n\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSeoRE7X27LyopxpoarzeuvDiAy-hprqWD-rfvFGlr9JDtQSWg/viewform?utm_id=hackathon\" rel=\"noopener noreferrer\">Submit your question</a> ahead of the workshop! Ask us about the Hackathon or V Systems, and ask Ksenia more about Shaders development!</p>\n\n<p>Whether you’re a beginner eager to learn about Shaders or an experienced developer looking to refine your skills, this session will provide valuable insights.​</p>\n\n<h2>\n  \n  \n  About Ksenia Kondrashova\n</h2>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fwxgf9c1m6gkdc8jejp4y.webp\"><img alt=\"Ksenia Kondrashova\" height=\"398\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2Fwxgf9c1m6gkdc8jejp4y.webp\" width=\"800\" /></a></p>\n\n<p>Ksenia is a freelance front-end developer with a focus on WebGL, Three.js, GLSL Shaders, SVG, and HTML5 Canvas. Her portfolio includes interactive animations and visualizations that push the boundaries of web graphics.</p>\n\n<p>She has contributed insightful tutorials on platforms like Codrops, covering topics such as creating interactive 3D dice rollers and exploring typing effects with Three.js and WebGL.</p>\n\n<h2>\n  \n  \n  Contact\n</h2>\n\n<ul>\n<li>X: uuuuuulala</li>\n<li>LinkedIn: ksenia-kondrashova</li>\n<li>Codepen: ksenia-k</li>\n<li>Website: <a href=\"https://ksenia-k.com\" rel=\"noopener noreferrer\">https://ksenia-k.com</a>\n</li>\n</ul>\n\n<h2>\n  \n  \n  Where can I learn more about the V Hackathon?\n</h2>\n\n<ul>\n<li><a href=\"https://hackathon.v.systems/\" rel=\"noopener noreferrer\">Official V Hackathon website</a></li>\n<li><a href=\"https://vsystems.medium.com/13-26-april-create-your-shader-to-win-up-to-1000-v-hackathon-f172e4ee3e55\" rel=\"noopener noreferrer\">How to join the V Hackathon</a></li>\n<li><a href=\"https://medium.com/vsystems/frequently-asked-questions-v-hackathon-42a78982da58\" rel=\"noopener noreferrer\">FAQ</a></li>\n<li><a href=\"https://medium.com/@vsystems/meet-the-judges-v-shaders-hackathon-b62454d4e144\" rel=\"noopener noreferrer\">About the Hackathon judges</a></li>\n<li><a href=\"https://gamedevjs.com/jam/2025/#challenges\" rel=\"noopener noreferrer\">V Hackathon on Gamedev.js</a></li>\n</ul>\n\n<p>The Hackathon started on 13 April. Please visit the <a href=\"https://hackathon.v.systems/\" rel=\"noopener noreferrer\">V Hackathon website</a> and join our <a href=\"https://t.me/vhackathon\" rel=\"noopener noreferrer\">Telegram</a> and <a href=\"https://discord.gg/2N9cWJ42JX\" rel=\"noopener noreferrer\">Discord</a> channels for more updates.</p>\n\n<h2>\n  \n  \n  About V Systems\n</h2>\n\n<p><a href=\"//www.v.systems\">V Systems (VSYS)</a> is an open-source network that supports the efficient and agile development of decentralized applications. It is designed for real-world use cases, making it possible to create, send, trade, and track tangible or intangible assets in a digital form. VSYS can handle millions of transactions daily and it runs on a decentralized, open network.</p>\n\n<h2>\n  \n  \n  Stay connected\n</h2>\n\n<ul>\n<li>Twitter @ VSYSCoin</li>\n<li>Telegram @ VSYS Official Group</li>\n<li>Medium @ V Systems</li>\n<li>YouTube @ V Systems</li>\n<li>Reddit @ V_SYSTEMS</li>\n<li>Github @ V Systems</li>\n</ul>\n\n<h2>\n  \n  \n  Cross-chain swap for VSYS tokens\n</h2>\n\n<ul>\n<li>Swap VSYS-TET tokens with Titan Wallet</li>\n<li>V Atomic Swap for USDT-VSYS</li>\n</ul>\n\n<h2>\n  \n  \n  Other useful links\n</h2>\n\n<ul>\n<li>VSYS Official Website</li>\n<li>Supernode Ranklist</li>\n<li>VSYS Blockchain Explorer</li>\n<li>Coinmarketcap</li>\n<li>Coingecko</li>\n</ul>",
    "what": "hackathon",
    "when_at": "2025-04-15 11:14:06.000000",
    "where_city": null,
    "who": "V_Systems",
    "skills": [
      "node",
      "aws",
      "ai",
      "ml",
      "blockchain"
    ],
    "topic_tags": [
      "webdev",
      "shaders",
      "webgl",
      "hackathon"
    ],
    "source_url": "https://dev.to/v_systems/15-april-shader-workshop-v-hackathon-1d01"
  },
  {
    "id": "5cc2ebbf-1098-48dc-8ba9-a5255a26c87b",
    "title": "How I Built a Gen AI Hackathon Project to Empower Elderly Care – Solo & on a Deadline",
    "description": "<p>Hey Devs!<br />\nI recently participated in the \"Hack the Future: A GenAI Sprint\" Hackathon and built a solo project called GuardianAI — a lightweight multi-agent system that supports elderly care using AI.</p>\n\n<p>I’m sharing my journey in this post — from idea to last-minute submission, everything I learned, and how it helped me grow as a builder. If you're into AI, Python, or hackathons, this one's for you.</p>\n\n<p>The Problem:<br />\nHow can we use GenAI to support elderly individuals in managing their health, daily routines, and emergencies?</p>\n\n<p>With rising concerns about elderly safety and independence, I found this challenge both meaningful and technically interesting.<br />\n My Solution: GuardianAI<br />\nI built GuardianAI, a command-line AI system powered by three agents working together:</p>\n\n<p>💓 Health Monitor Agent – Analyzes vitals like heart rate, BP, and flags anomalies.</p>\n\n<p>⏰ Reminder Agent – Displays personalized daily tasks like medication and hydration.</p>\n\n<p>🚨 Alert Agent – Collects alerts and shows emergency warnings.</p>\n\n<p>Each agent uses real-time data from CSV files and communicates via Python functions — a clean, modular architecture.</p>\n\n<p>🛠️ Tech Stack<br />\nPython 3.11</p>\n\n<p>pandas</p>\n\n<p>CLI (Command Line Interface)</p>\n\n<p>GitHub (for version control + hosting)</p>\n\n<p>YouTube + OneDrive (for final demo &amp; slides)</p>\n\n<p>I kept it simple — no flashy web app, just a clear proof of concept.</p>\n\n<p>📂 GitHub Repo<br />\nFull code, agents, data files, and PPT:<br />\n🔗 GitHub – [<a href=\"https://github.com/AstutiJ/-AstutiJ-Elderly-Care-AI-Hackathon-Project/commit/bb494faeaea79f4a45b04dc1c90e3cc8b7819967\" rel=\"noopener noreferrer\">https://github.com/AstutiJ/-AstutiJ-Elderly-Care-AI-Hackathon-Project/commit/bb494faeaea79f4a45b04dc1c90e3cc8b7819967</a>]</p>\n\n<p>💭 What I Learned<br />\nStart, even if it’s messy or rushed.</p>\n\n<p>Build for impact, not just for flash.</p>\n\n<p>Agent-based thinking is powerful in AI architecture.</p>\n\n<p>Solo building can teach you more than team projects sometimes!</p>\n\n<p>💚 The Bigger Win<br />\nEven if I don’t win a prize, this project gave me real confidence. It re-sparked my motivation to continue my 90 Days of DevOps blog series — which I had paused due to illness.</p>\n\n<p>This blog marks my comeback — and I’m super excited to keep building, learning, and sharing.</p>\n\n<p>👋 Final Thoughts<br />\nIf you’ve ever felt like you're not \"ready\" for a hackathon, I promise — you’ll learn more by showing up and trying than by waiting.</p>\n\n<p>Thanks for reading, and feel free to check out my project repo, video, or connect here!</p>",
    "what": "hackathon",
    "when_at": "2025-04-14 18:35:28.000000",
    "where_city": null,
    "who": "ByteMotive Blog",
    "skills": [
      "python",
      "ai",
      "devops"
    ],
    "topic_tags": [
      "womenintech",
      "sideprojects",
      "hackathon",
      "python"
    ],
    "source_url": "https://dev.to/s_j_9c4bdb31f6630da7/how-i-built-a-gen-ai-hackathon-project-to-empower-elderly-care-solo-on-a-deadline-18dc"
  },
  {
    "id": "31d808c1-bc84-4e55-9c04-e0e1569aab76",
    "title": "Turning Real Problems into Ideas For A Tech Startup: A Developer's Perspective",
    "description": "<p>Most great startups didn’t start with a big pitch deck — they started with someone annoyed enough to fix something.</p>\n\n<p><a class=\"article-body-image-wrapper\" href=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F66ymfzkxu8gtlmetvzip.jpg\"><img alt=\"Image description\" height=\"1000\" src=\"https://media2.dev.to/dynamic/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F66ymfzkxu8gtlmetvzip.jpg\" width=\"666\" /></a></p>\n\n<p>Every day, thousands of students work on engineering college projects, submit science fair projects for high school, or tinker with student engineering project ideas. What separates a regular school project from a potential tech startup?</p>\n\n<p>The answer: Real-world problems.<br />\n**<br />\n<strong>🧠 Why Real Problems Matter</strong>**</p>\n\n<p>Here’s the truth — flashy ideas don’t always make it. But real problems do.</p>\n\n<p>The world has more than enough to-do list apps. What it lacks is real innovation that fixes everyday issues. If you’ve ever said:</p>\n\n<p>\"Why is this still so slow?\"</p>\n\n<p>\"Why isn’t there an app for this?\"</p>\n\n<p>\"Why do people still use paper for this?\"</p>\n\n<p>Then congratulations — you’ve encountered a problem worth solving.</p>\n\n<p><strong>## 💡 From Problem to Project</strong></p>\n\n<p>Here are a few ways problem solving business ideas start in the real world:</p>\n\n<p>A high school student noticed her mom forgetting medication → Built a pill reminder app.</p>\n\n<p>Engineering grads saw water wastage in fields → Made an automated irrigation system.</p>\n\n<p>Someone’s Wi-Fi kept going down during online classes → Built a self-rebooting Wi-Fi watchdog.</p>\n\n<p>None of these were built with business in mind. But they addressed world problems that need to be solved — and that’s where good dev projects live.</p>\n\n<p><strong>## 🔍 What Kind of Projects Are We Talking About?</strong></p>\n\n<p>Let’s get specific:</p>\n\n<p>Project Type    Real Problem Tackled<br />\nIoT-based Smart Helmet  No helmet, no ignition — saves lives<br />\nWeb App for Farmer Markets  No digital access in rural commerce<br />\nPython Tool for Blind Students  Converts text to voice using camera input<br />\nLow-Cost Air Quality Monitor    Real-time pollution data for low-income areas<br />\nThese started as engineering college projects, but with the right mindset, they’re startup MVPs in disguise.</p>\n\n<p><strong>## 👨‍💻 Devs: You Already Have the Skills</strong></p>\n\n<p>Most developers underestimate their daily skills. You write scripts, automate things, build UIs, and make systems smarter.</p>\n\n<p>Why not apply those same skills to a student engineering project idea that impacts lives?</p>\n\n<p>Build open-source versions of overpriced tools.</p>\n\n<p>Help local communities automate boring workflows.</p>\n\n<p>Partner with NGOs or schools that need tech but lack devs.</p>\n\n<p>Even if you never launch a company, the project becomes your real-world portfolio.</p>\n\n<p><strong>## 🌐 Where to Start?</strong></p>\n\n<p>That’s where <strong><a href=\"https://innovationforu.com/\" rel=\"noopener noreferrer\">InnovationForU.com</a></strong> fits in.</p>\n\n<p>It’s a collection of real problems — not made-up startup prompts — that students and creators can explore. No hype, just opportunities. Use them to build your next hackathon project, capstone assignment, or side hustle.</p>\n\n<h2>\n  \n  \n  <strong>⚙️ Final Take</strong>\n</h2>\n\n<p>Every time you ask, “Why hasn’t anyone fixed this yet?” — that’s your cue.</p>\n\n<p>The gap between a class project and a funded startup isn’t always that big. It’s usually just:</p>\n\n<p>Solving something real</p>\n\n<p>Sharing it publicly</p>\n\n<p>Iterating based on feedback</p>\n\n<p>You don’t need VC funding. You need curiosity and a bit of code.</p>\n\n<p>**</p>\n\n<h2>\n  \n  \n  ✨ TL;DR\n</h2>\n\n<p>**<br />\nReal problems &gt; random ideas</p>\n\n<p>Your skills as a developer are enough to start</p>\n\n<p>Projects can become businesses — if they solve real pain</p>\n\n<p>Innovation starts with empathy, not just code</p>\n\n<p>Want ideas to get started? Head over to InnovationForU.com and pick a problem. Then go build.</p>",
    "what": "hackathon",
    "when_at": "2025-04-14 15:07:05.000000",
    "where_city": null,
    "who": "Olivia",
    "skills": [
      "python",
      "aws",
      "ai"
    ],
    "topic_tags": [
      "webdev",
      "startup",
      "programming",
      "hackathon"
    ],
    "source_url": "https://dev.to/olivia_innovation/turning-real-problems-into-ideas-for-a-tech-startup-a-developers-perspective-5gba"
  },
  {
    "id": "cea899da-2590-4ad5-b3b4-e3a411613d09",
    "title": "Hackathon Doubts",
    "description": "<p>Hello everyone this is my first post on this platform <br />\nI wish to get some cool hackathon ideas in AIML field.</p>",
    "what": "hackathon",
    "when_at": "2025-04-11 18:57:55.000000",
    "where_city": null,
    "who": "Krish D Shah",
    "skills": [
      "ai",
      "ml"
    ],
    "topic_tags": [
      "hackathon",
      "ai",
      "programming",
      "ideas"
    ],
    "source_url": "https://dev.to/thekrishdshah/hackathon-doubts-27m7"
  }
]